src/DataProcessors/ит_ВыгрузкаЗакрытиеСменВОбщепит.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ит_ВыгрузкаЗакрытиеСменВОбщепит</Name>
			<Comment>Попов Л.Г., 2025-11-28</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ит_ЗакрытиеСменыКВыгрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ит_ЗакрытиеСменыКВыгрузке</Name>
			<Comment>Попов Л.Г., 2025-11-26</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ОбъектВыгрузки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/SSL_IT_ФорматыДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>SSL_IT_ФорматыДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Строка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>XML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JSON</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>XDTO_XML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>XDTO_JSON</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Файл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДвоичныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поток</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ит_НастройкаИнтеграцииШина.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ит_НастройкаИнтеграцииШина</Name>
			<Comment>//Попов Л.Г., 2026-01-12</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ит_ВыгрузкаЗакрытиеСменВОбщепит/Ext/ObjectModule.bsl
Перем мВерсия;
Перем мИнформация;
Перем мПредставление;
Перем мИмя;

Функция СведенияОВнешнейОбработке() Экспорт

    ПараметрыРегистрации					 = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.4.3.98");
	ПараметрыРегистрации.Вид				 = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия				 = мВерсия;
	ПараметрыРегистрации.БезопасныйРежим	 = ЛОЖЬ;
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд,
		мПредставление,
		"Форма",
		"ОткрытиеФормы",
		Ложь,
		Неопределено);
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
  
    Возврат ПараметрыРегистрации;

КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды) Экспорт  
	
	ЗаписьЖурналаРегистрации("Выполнение команды", УровеньЖурналаРегистрации.Примечание,,,"Обработка HTTP запроса");
	
КонецПроцедуры

Функция ВыполнитьМетод(ИмяМетода = Неопределено, ДанныеЗапроса = Неопределено, МетодПоддерживается = Истина, Ошибки = "") Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ит_ЗакрытиеСменыКВыгрузке.ОбъектВыгрузки КАК ОбъектВыгрузки
		|ИЗ
		|	РегистрСведений.ит_ЗакрытиеСменыКВыгрузке КАК ит_ЗакрытиеСменыКВыгрузке";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Данные = ПолучитьДанныеДокумента(ВыборкаДетальныеЗаписи.ОбъектВыгрузки);
		Если Данные.Количество() > 0 Тогда
			ОтправитьЗапросВБухгалтерию(Данные, ВыборкаДетальныеЗаписи.ОбъектВыгрузки);
		КонецЕсли;
		
	КонецЦикла;

	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьДанныеДокумента(Ссылка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = СоздатьЗапросДанныхДокумента();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатПакета = Запрос.ВыполнитьПакет();
	
	Если РезультатПакета[0].Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеДокументов = Новый Массив;
	
	ДанныеДокумента = Новый Структура;
	
	// Основные данные документа
	ДокументДанные = ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатПакета[0].Выгрузить());
	ДанныеДокумента.Вставить("ДокументДанные", ДокументДанные[0]);
	
	// Товары (обязательная табличная часть)
	ТоварыДанные = ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатПакета[1].Выгрузить());
	ДанныеДокумента.Вставить("ТоварыДанные", ТоварыДанные);
	
	// Возвраты (необязательная табличная часть)
	Если НЕ РезультатПакета[2].Пустой() Тогда
		ВозвратыДанные = ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатПакета[2].Выгрузить());
		ДанныеДокумента.Вставить("ВозвратыДанные", ВозвратыДанные);
	КонецЕсли;
	
	// Оплаты (необязательная табличная часть)
	Если НЕ РезультатПакета[3].Пустой() Тогда
		ОплатыДанные = ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатПакета[3].Выгрузить());
		ДанныеДокумента.Вставить("ОплатыДанные", ОплатыДанные);
	КонецЕсли;
	
	// Возврат оплаты (необязательная табличная часть)
	Если НЕ РезультатПакета[4].Пустой() Тогда
		ВозвратОплатыДанные = ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатПакета[4].Выгрузить());
		ДанныеДокумента.Вставить("ВозвратОплатыДанные", ВозвратОплатыДанные);
	КонецЕсли;
	
	ДанныеДокументов.Добавить(ДанныеДокумента);
	
	Возврат ДанныеДокументов;
	
КонецФункции

Функция СоздатьЗапросДанныхДокумента()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗакрытиеСмены.Номер КАК Номер,
		|	ЗакрытиеСмены.Дата КАК Дата,
		|	ЗакрытиеСмены.Проведен КАК Проведен,
		|	ЗакрытиеСмены.КассаККМ.Наименование КАК КассаККМНаименование,
		|	ЗакрытиеСмены.СкладКомпании.ЕРПМастерКлюч КАК СкладКомпанииЕРПМастерКлюч,
		|	ЗакрытиеСмены.ДатаОперации КАК ДатаОперации,
		|	ЗакрытиеСмены.Организация.ЕРПМастерКлюч КАК ОрганизацияЕРПМастерКлюч,
		|	ЗакрытиеСмены.ПодразделениеКомпании.ЕРПМастерКлюч КАК ПодразделениеКомпанииЕРПМастерКлюч,
		|	ЗакрытиеСмены.СуммаДокумента КАК СуммаДокумента
		|ИЗ
		|	Документ.ЗакрытиеСмены КАК ЗакрытиеСмены
		|ГДЕ
		|	ЗакрытиеСмены.Ссылка = &Ссылка
		|	И ЗакрытиеСмены.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗакрытиеСменыТовары.Номенклатура.ЕРПМастерКлюч КАК НоменклатураЕРПМастерКлюч,
		|	ЗакрытиеСменыТовары.ЕдиницаИзмерения.ЕРПМастерКлюч КАК ЕдиницаИзмеренияЕРПМастерКлюч,
		|	ЗакрытиеСменыТовары.Коэффициент КАК Коэффициент,
		|	ЗакрытиеСменыТовары.Количество КАК Количество,
		|	ЗакрытиеСменыТовары.Цена КАК Цена,
		|	ЗакрытиеСменыТовары.Сумма КАК Сумма,
		|	ЗакрытиеСменыТовары.СуммаНДС КАК СуммаНДС,
		|	ЗакрытиеСменыТовары.СтавкаНДС.Ставка КАК СтавкаНДССтавка,
		|	ЗакрытиеСменыТовары.СуммаВсего КАК СуммаВсего
		|ИЗ
		|	Документ.ЗакрытиеСмены.Товары КАК ЗакрытиеСменыТовары
		|ГДЕ
		|	ЗакрытиеСменыТовары.Ссылка = &Ссылка
		|	И ЗакрытиеСменыТовары.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗакрытиеСменыВозвраты.Номенклатура.ЕРПМастерКлюч КАК НоменклатураЕРПМастерКлюч,
		|	ЗакрытиеСменыВозвраты.ЕдиницаИзмерения.ЕРПМастерКлюч КАК ЕдиницаИзмеренияЕРПМастерКлюч,
		|	ЗакрытиеСменыВозвраты.Количество КАК Количество,
		|	ЗакрытиеСменыВозвраты.Цена КАК Цена,
		|	ЗакрытиеСменыВозвраты.Сумма КАК Сумма,
		|	ЗакрытиеСменыВозвраты.СуммаНДС КАК СуммаНДС,
		|	ЗакрытиеСменыВозвраты.СтавкаНДС.Ставка КАК СтавкаНДССтавка,
		|	ЗакрытиеСменыВозвраты.СуммаВсего КАК СуммаВсего
		|ИЗ
		|	Документ.ЗакрытиеСмены.Возвраты КАК ЗакрытиеСменыВозвраты
		|ГДЕ
		|	ЗакрытиеСменыВозвраты.Ссылка.Ссылка = &Ссылка
		|	И ЗакрытиеСменыВозвраты.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗакрытиеСменыОплаты.ТипОплаты.Наименование КАК ТипОплатыНаименование,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗакрытиеСменыОплаты.ТипОплаты.ВидОплаты) КАК ТипОплатыВидОплатыПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗакрытиеСменыОплаты.ТипОплаты) КАК ТипОплатыПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗакрытиеСменыОплаты.Карточка) КАК КарточкаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗакрытиеСменыОплаты.ТипПлатежнойКарты) КАК ТипПлатежнойКартыПредставление,
		|	ЗакрытиеСменыОплаты.Сумма КАК Сумма,
		|	ЗакрытиеСменыОплаты.СуммаВозврат КАК СуммаВозврат,
		|	ЗакрытиеСменыОплаты.СуммаНДС КАК СуммаНДС,
		|	ЗакрытиеСменыОплаты.СуммаОплата КАК СуммаОплата,
		|	ЗакрытиеСменыОплаты.СуммаНДСОплата КАК СуммаНДСОплата
		|ИЗ
		|	Документ.ЗакрытиеСмены.Оплаты КАК ЗакрытиеСменыОплаты
		|ГДЕ
		|	ЗакрытиеСменыОплаты.Ссылка = &Ссылка
		|	И ЗакрытиеСменыОплаты.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗакрытиеСменыВозвратОплаты.ТипОплаты.Наименование КАК ТипОплатыНаименование,
		|	ЗакрытиеСменыВозвратОплаты.Сумма КАК Сумма,
		|	ЗакрытиеСменыВозвратОплаты.СуммаОплата КАК СуммаОплата
		|ИЗ
		|	Документ.ЗакрытиеСмены.ВозвратОплаты КАК ЗакрытиеСменыВозвратОплаты
		|ГДЕ
		|	ЗакрытиеСменыВозвратОплаты.Ссылка = &Ссылка
		|	И ЗакрытиеСменыВозвратОплаты.Ссылка.Проведен";
	
	Возврат Запрос;
	
КонецФункции

Функция ОтправитьЗапросВБухгалтерию(Данные, Ссылка) 
	
	УстановитьПривилегированныйРежим(Истина);
	
	НастройкиИнтеграциия = Справочники.ит_НастройкаИнтеграцииШина.ИнтеграцияСОбщепит;
	
	АдресСервера = НастройкиИнтеграциия.АдресСервера;
	АдресСервиса = НастройкиИнтеграциия.АдресСервиса;           
	Порт = НастройкиИнтеграциия.Порт;
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресСервиса);
	
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/xml");
	HTTPЗапрос.Заголовки.Вставить("GetExchangeRate", Истина); 
	
	SSL_IT_HTTPСервисы.УстановитьТело(HTTPЗапрос, Данные, Перечисления.SSL_IT_ФорматыДанных.XDTO_XML);
	
	РезультатЗапроса = ВыполнитьЗапрос(HTTPЗапрос, АдресСервера, Порт, "POST");
	
	Если РезультатЗапроса.ЗапросВыполнен Тогда
		ОтветСервиса = "Запрос успешно отправлен." + ?(РезультатЗапроса.ОтветСервиса = "", "", Символы.ПС + "Ответ:" + Символы.ПС + РезультатЗапроса.ОтветСервиса);
		РегистрыСведений.ит_ЗакрытиеСменыКВыгрузке.УдалитьЗаписьРС(Ссылка);
	Иначе 
		ОтветСервиса = "Ошибка:" + Символы.ПС + РезультатЗапроса.ТекстОшибки;
	КонецЕсли;
	
	СобытиеЖурналаРегистрации = "ОбменШина";
	ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации, УровеньЖурналаРегистрации.Информация, , , ОтветСервиса);
	
	Возврат ОтветСервиса;
КонецФункции

Функция ВыполнитьЗапрос(Знач HTTPЗапрос, Знач АдресСервера, Знач Порт, ТипЗапроса = "GET")

    Результат = Новый Структура;
    Результат.Вставить("ЗапросВыполнен", Ложь);
    Результат.Вставить("ОтветСервиса", "");
    Результат.Вставить("ТекстОшибки", "");

    Попытка
        Соединение = Новый HTTPСоединение(АдресСервера, Порт, , , , 60);
        Если ТипЗапроса = "POST" Тогда
            HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
        Иначе
            HTTPОтвет = Соединение.Получить(HTTPЗапрос);
        КонецЕсли; 
    Исключение
        Результат.ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
        НСтр("ru = 'Не удалось установить соединение с сервером %1 по причине:
        |'"), АдресСервера, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
        Возврат Результат;
    КонецПопытки;

    Если HTTPОтвет.КодСостояния <> 200 Тогда
        ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
        НСтр("ru = 'Запрос ""%1"" не выполнен. Код состояния: .'"),
        HTTPЗапрос.АдресРесурса,
        HTTPОтвет.КодСостояния) + Символы.ПС + HTTPОтвет.ПолучитьТелоКакСтроку();
        Результат.ТекстОшибки = ТекстОшибки;
        Возврат Результат;
    КонецЕсли;

    Если HTTPОтвет.КодСостояния = 401 
        Или HTTPОтвет.КодСостояния = 403 Тогда
        ИнформацияОбОшибке = JSONВЗначение(HTTPОтвет.ПолучитьТелоКакСтроку());
        Результат.ТекстОшибки = ИнформацияОбОшибке["error"]["message"];
        Возврат Результат;
    КонецЕсли;

    Результат.ЗапросВыполнен = HTTPОтвет.КодСостояния = 200;
    Результат.ОтветСервиса = HTTPОтвет.ПолучитьТелоКакСтроку();

    Возврат Результат;

КонецФункции

Функция ЗначениеВJSON(Значение)
    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку();
    ЗаписатьJSON(ЗаписьJSON, Значение);
    Возврат ЗаписьJSON.Закрыть();
КонецФункции

Функция JSONВЗначение(Строка, МассивСвойствИЗначений = Неопределено)
    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(Строка);
    Возврат ПрочитатьJSON(ЧтениеJSON, Истина, МассивСвойствИЗначений);
КонецФункции


мВерсия			  = "1.2";
мИнформация		  = "Передача данных из ЕСУР в Общепит (ИТ)";
мПредставление	  = "Передача данных из ЕСУР в Общепит (ИТ)";
мИмя			  = "ESB_IT_ПередачаКассовыхСмен";
